export const ERROR_MESSAGES = {
  "5001":
    "متاسفانه یک مشکل در اتصال به سرور به وجود آمده است. لطفاً اتصال اینترنت خود را بررسی کنید و دوباره تلاش کنید.",
  "4041": "متاسفانه مورد درخواستی یافت نشد.",
  "4042": "متاسفانه مسیر درخواستی یافت نشد.",
  "4221": `متاسفانه اطلاعات ارسالی نامعتبر است. لطفاً اطمینان حاصل کنید که درخواست شما به درستی تنظیم شده است.`,
  "4222": `متاسفانه اطلاعات ارسالی دارای خطاهای اعتبارسنجی می‌باشند. لطفاً اطلاعات خود را بررسی کرده و دوباره تلاش کنید`,
  "4091": `متاسفانه یک مورد مشابه قبلاً ذخیره شده است. لطفاً اطمینان حاصل کنید که اطلاعات وارد شده تکراری نیستند.`,
  "4001": `متاسفانه شناسه مورد نامعتبر است. لطفاً یک شناسه صحیح وارد کنید.`,
  "4002": `مقدار وارد شده برای تعداد موارد در هر صفحه نامعتبر است. لطفاً یک مقدار صحیح انتخاب کنید.`,
  "4031": `متاسفانه کلید API احراز هویت نامعتبر است. لطفاً اطمینان حاصل کنید که کلید API صحیح وارد شده است.`,
  "5041": `متاسفانه زمان انقضای درخواست به پایان رسیده است. لطفاً مجدداً تلاش کنید یا اتصال اینترنت خود را بررسی کنید.`,
  invalidResponse:
    "متاسفانه پاسخ دریافتی از سرور نامعتبر است. لطفاً مجدداً تلاش کنید یا با پشتیبانی تماس بگیرید.",
  default: `متاسفانه مشکلی پیش آمده است. لطفاً بعداً تلاش کنید یا با پشتیبانی تماس بگیرید.`,
};

export const D_PER_PAGE = 10
